package test;

import java.util.HashMap;
import java.util.Map;
import java.util.Map.Entry;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class TestRegex {
	public static void main(String[] args) {
//		¼­¿ïÆ¯º°½Ã ¸¶Æ÷±¸¿¡ »ç´Â »ç¶÷Àº 1¸í
//		ºÎ»ê±¤¿ª½Ã µ¿±¸¿¡ »ç´Â »ç¶÷Àº 2¸í
//		¼­¿ïÆ¯º°½Ã Áß¶û±¸¿¡ »ç´Â »ç¶÷Àº 2¸í
//		¼­¿ïÆ¯º°½Ã ³ë¿ø±¸¿¡ »ç´Â »ç¶÷Àº 1¸í
//		ÀÎÃµ±¤¿ª½Ã ³²µ¿±¸¿¡ »ç´Â »ç¶÷Àº 1¸í
//		°æ±âµµ ±¸¸®½Ã¿¡ »ç´Â »ç¶÷Àº 1¸í
//		¼­¿ï Áß¶û±¸¿¡ »ç´Â »ç¶÷Àº 1¸í
//		¼­¿ïÆ¯º°½Ã ±¸·Î±¸¿¡ »ç´Â »ç¶÷Àº 1¸í
//		ÃæÃ»³²µµ ¿¹»ê±º¿¡ »ç´Â »ç¶÷Àº 1¸í
//		ÃæÃ»³²µµ Ãµ¾È½Ã¿¡ »ç´Â »ç¶÷Àº 1¸í
//		ÃæÃ»³²µµ ´çÁø½Ã¿¡ »ç´Â »ç¶÷Àº 1¸í
		// Ä¶¸®Æ÷´Ï¾ÆÁÖ ´º¿å½Ã 
		
		// ½Ã,±º,±¸·Î ³¡³ª´Â ºÎºÐ  (¾Õ¿¡ÀÖ´Â ¹®ÀÚ ÃæÃ»³²µµ ¼­¿ïÆ¯º°½Ã °Ç³Ê¶ç°í °ø¹éÇÏ³ª¿¡ ½Ã±º±¸·Î ³¡³² ~~µµ,½Ã \\s 
 		String reg = "([°¡-ÆR]+[^ÁÖ]\\s{1}[°¡-ÆR]+[½Ã±º±¸] {1})";
		//~½Ã¿¡ »ì°Å³ª ¼­¿ï, ÀÎÃµ, ´ë±¸, ±¤ÁÖ, ºÎ»ê, ¿ï»ê ÀÇ ÁÖ¼Ò¸¦ °¡Áö°í µÚÂÊ¿¡ ½Ã, ±º,±¸ ·Î ³¡³ª´Â ºÎºÐÀ»
		Map<String, Integer> map = new HashMap<String, Integer>();
		//Å°¿öµå¿Í °¹¼ö¸¦ °¡Áö´Â ¸®½ºÆ®¿¡
		String[] addresses = { "¼­¿ïÆ¯º°½Ã Áß¶û±¸ °ø¸ª·Î 13±æ 27", "¼­¿ïÆ¯º°½Ã Áß¶û±¸ °âÀç·Î 68 (¸é¸ñµ¿)",
				"¼­¿ïÆ¯º°½Ã ³ë¿ø±¸ °ø¸ª·Î 95 (°ø¸ªµ¿)",
				"¼­¿ïÆ¯º°½Ã ±¸·Î±¸ °¡¸¶»ê·Î 77 (±¸·Îµ¿)", "¼­¿ïÆ¯º°½Ã ¸¶Æ÷±¸ °¡¾ç´ë·Î 1 (»ó¾Ïµ¿)",
				"ÃæÃ»³²µµ Ãµ¾È½Ã µ¿³²±¸ ¼º³²¸é 5»ê´Ü1·Î 22",
				"ºÎ»ê±¤¿ª½Ã µ¿±¸ °í°ü·Î 5 (ÃÊ·®µ¿)", "ÀÎÃµ±¤¿ª½Ã ³²µ¿±¸ °£¼®·Î 2 (°£¼®µ¿)",
				"ÃæÃ»³²µµ ¿¹»ê±º ½Å¾Ï¸é ¿À½Å·Î 852-2", "ÃæÃ»³²µµ ´çÁø½Ã ¿ì°­¸é ¹Ú¿ø·Î 138",
				"ºÎ»ê±¤¿ª½Ã µ¿±¸ Áß¾Ó´ë·Î 243-13 (ÃÊ·®µ¿)", "°æ±âµµ ±¸¸®½Ã µ¿±¸¸ª·Î136¹ø±æ 47 (ÀÎÃ¢µ¿)",
				"¼­¿ï Áß¶û±¸ °ø¸ª·Î 13±æ 27",
				"Ä¶¸®Æ÷´Ï¾ÆÁÖ ´º¿å½Ã LAµµ·Î 100"};		
		
		Pattern p = Pattern.compile(reg);
		for (String address : addresses) {
			Matcher m = p.matcher(address);
			if (m.find()) {
				map.put(m.group(), map.getOrDefault(m.group(), 0) + 1);
				}
			}

		for (Entry<String, Integer> s : map.entrySet())
			System.out.println(s.getKey() + "¿¡ »ç´Â »ç¶÷Àº " + s.getValue() + "¸í");

	}
}
